RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_mdf.c
          /* Enable out-off limit detector */
          hmdf->Instance->OLDCR |= MDF_OLDCR_OLDEN;
        }
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to poll for the out-off limit detection.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @param  pThresholdInfo Threshold information of out-off limit detection.
  *         This parameter can be a value of @ref MDF_OldThresholdInfo.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_PollForOld(MDF_HandleTypeDef *hmdf, uint32_t Timeout, uint32_t *pThresholdInfo)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_INSTANCE(hmdf->Instance));
  if (pThresholdInfo == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check state */
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      if (hmdf->State != HAL_MDF_STATE_READY)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Check out-off limit detector status */
    if ((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) != MDF_OLDCR_OLDACTIVE)
    {
      status = HAL_ERROR;
    }
    else
    {
      uint32_t tickstart = HAL_GetTick();

      /* Wait for out-off limit detection */
      while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_OLDF) != MDF_DFLTISR_OLDF) && (status == HAL_OK))
      {
        /* Check the timeout */
        if (Timeout != HAL_MAX_DELAY)
        {
          if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
          {
            status = HAL_TIMEOUT;
          }
        }
      }

      if (status == HAL_OK)
      {
        /* Get threshold information */
        if ((hmdf->Instance->DFLTISR & (MDF_DFLTISR_THLF | MDF_DFLTISR_THHF)) == 0U)
        {
          *pThresholdInfo = MDF_OLD_IN_THRESHOLDS;
        }
        else if ((hmdf->Instance->DFLTISR & MDF_DFLTISR_THLF) == MDF_DFLTISR_THLF)
        {
          *pThresholdInfo = MDF_OLD_LOW_THRESHOLD;
        }
        else
        {
          *pThresholdInfo = MDF_OLD_HIGH_THRESHOLD;
        }

        /* Clear out-off limit detection flags */
        hmdf->Instance->DFLTISR |= MDF_DFLTISR_OLDF;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop out-off limit detection in polling mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_OldStop(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_INSTANCE(hmdf->Instance));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check out-off limit detector status */
    if ((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) != MDF_OLDCR_OLDACTIVE)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Disable out-off limit detection */
      hmdf->Instance->OLDCR &= ~(MDF_OLDCR_OLDEN);

      /* Clear potential pending out-off limit detection flags */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_OLDF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start out-off limit detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @param  pOldConfig Out-off limit detector configuration parameters.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_OldStart_IT(MDF_HandleTypeDef *hmdf, MDF_OldConfigTypeDef *pOldConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pOldConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_MDF_INSTANCE(hmdf->Instance));
    assert_param(IS_MDF_OLD_CIC_MODE(pOldConfig->OldCicMode));
    assert_param(IS_MDF_OLD_DECIMATION_RATIO(pOldConfig->OldDecimationRatio));
    assert_param(IS_MDF_OLD_THRESHOLD(pOldConfig->HighThreshold));
    assert_param(IS_MDF_OLD_THRESHOLD(pOldConfig->LowThreshold));
    assert_param(IS_MDF_OLD_EVENT_CONFIG(pOldConfig->OldEventConfig));
    assert_param(IS_MDF_BREAK_SIGNAL(pOldConfig->BreakSignal));
    if (pOldConfig->LowThreshold >= pOldConfig->HighThreshold)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Check state */
      if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
      {
        if (hmdf->State != HAL_MDF_STATE_READY)
        {
          status = HAL_ERROR;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Check out-off limit detector status */
      if ((hmdf->Instance->OLDCR & MDF_OLDCR_OLDACTIVE) == MDF_OLDCR_OLDACTIVE)
      {
        status = HAL_ERROR;
      }
      else
      {
        /* Check filter status */
        if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) == MDF_DFLTCR_DFLTACTIVE)
        {
          /* Check main filter order */
          if ((hmdf->Instance->DFLTCICR & MDF_DFLTCICR_CICMOD) >= MDF_ONE_FILTER_SINC4)
          {
            status = HAL_ERROR;
          }
        }
        else
        {
          /* Reset main filter order */
          hmdf->Instance->DFLTCICR &= ~(MDF_DFLTCICR_CICMOD);
        }

        if (status == HAL_OK)
        {
          /* Configure OLD CIC mode, decimation ratio, event and break signal */
          hmdf->Instance->OLDCR = (pOldConfig->OldCicMode | pOldConfig->OldEventConfig |
                                   ((pOldConfig->OldDecimationRatio - 1U) << MDF_OLDCR_ACICD_Pos) |
                                   (pOldConfig->BreakSignal << MDF_OLDCR_BKOLD_Pos));

          /* Configure low and high thresholds */
          hmdf->Instance->OLDTHLR = (uint32_t) pOldConfig->LowThreshold;
          hmdf->Instance->OLDTHHR = (uint32_t) pOldConfig->HighThreshold;

          /* Enable out-off limit detector interrupt */
          hmdf->Instance->DFLTIER |= MDF_DFLTIER_OLDIE;

